app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ('Book1', '2026-01-27 00:51:04.304728', '2026-01-27 00:51:04.304728') RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save

UPDATE "books" SET "title" = 'Book8', "updated_at" = '2026-01-27 00:51:27.744374' WHERE "books"."id" = 1
---
  def update
    if @book.update(book_params)